Repository: Esukhia/Corpora
Catalog: Parallel/84000/UT22084-047-002.tmx
Source language: bo
Languages: en

source: འཕགས་པ་སངས་རྒྱས་ཐམས་ཅད་ཀྱི་ཡུལ་ལ་འཇུག་པའི་ཡེ་ཤེས་སྣང་བའི་རྒྱན་
en: The Ornament of the Light of Awareness that Enters the Domain of All Buddhas

source: ཅེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ། བམ་པོ་དང་པོ།
en: The Noble Mahāyāna Sūtra

source: སངས་རྒྱས་དང་བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་ལ་ཕྱག་འཚལ་ལོ།
en: Homage to the Buddha!

source: འདི་སྐད་བདག་གིས་ཐོས་པ་དུས་གཅིག་ན།
en: Thus have I heard, at one time,

source: བཅོམ་ལྡན་འདས་རྒྱལ་པོའི་ཁབ་ན་བྱ་རྒོད་ཕུང་པོའི་རིའི་རྩེ་མོ་བཞིའི་ཤིང་དྲུང་ཆོས་ཀྱི་དབྱིངས་ཀྱི་སྙིང་པོའི་ཁང་བཟངས་ན།འདི་ལྟ་སྟེ།
en: the Bhagavat was dwelling on the Vulture Peak Mountain in Rājgir, on a summit of infinite gems, in the Womb of Dharmadhātu Palace,

source: ཉན་ཐོས་ཆེན་པོ་བརྒྱད་དང་ཀུན་ཤེས་ཀོོཎྜི་ནྱ་ལ་སོགས་པ་
en: The sixty-eight great hearers, headed by Ājñātakauṇḍinya, were also there.

source: དགེ་སློང་ཉི་ཁྲི་ལྔ་སྟོང་གི་དགེ་སློང་གི་དགེ་འདུན་ཆེན་པོ་ཐམས་ཅད་ཀྱང་
en: together with a great assembly of twenty-five thousand monks.

source: དགྲ་བཅོམ་པ་ཟག་པ་ཟད་པ།
en: All of them were arhats who had exhausted their outflows.

source: ཉོན་མོངས་པ་མེད་པ་དབང་དང་ལྡན་པར་གྱུར་པ།
en: They were without afflictions and controlled.

source: སེམས་ཤིན་ཏུ་རྣམ་པར་གྲོལ་བ།
en: Their minds were perfectly liberated,

source: ཤེས་རབ་ཤིན་ཏུ་རྣམ་པར་གྲོལ་བ།
en: and their wisdom was perfectly free.

source: ཅང་ཤེས་པ་གླང་པོ་ཆེན་པོ་བྱ་བ་བྱས་པ།
en: They were knowledgeable great elephants who had accomplished

source: བྱེད་པ་བྱས་པ།
en: what needed to be done.

source: ཁུར་བོར་བ་བདག་གི་དོན་རྗེས་སུ་ཐོབ་པ།
en: They had laid down their burden and fulfilled their own benefit.

source: སྲིད་པ་ཀུན་ཏུ་སྦྱོར་བ་ཡོངས་སུ་ཟད་པ།
en: They had destroyed the bonds of existence and, thanks to their correct knowledge, their minds were perfectly liberated.

source: ཡང་དག་པའི་ཤེས་པས་སེམས་ཤིན་ཏུ་རྣམ་པར་གྲོལ་བ།
en: They had obtained supreme perfection in mastering all mental states.

source: སེམས་ཅན་ཐམས་ཅད་ཀྱི་དབང་གི་དམ་པའི་ཕ་རོལ་ཏུ་སོན་པ་ཤ་སྟག་དང་འདི་ལྟ་སྟེ།
en: All of them were turning the Dharma wheel that does not turn back.

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པ་དང་།
en: such as the youthful Mañjuśrī,

source: ནོར་དཔལ་དང་།
en: Dhanaśrī,

source: སངས་རྒྱས་དཔལ་དང་།
en: Buddhiśrī,

source: སྨན་གྱི་རྒྱལ་པོ་དང་།
en: Bhaiṣajyarāja,

source: སྨན་ཡང་དག་འཕགས་ལ་སོགས་པ་འཇིག་རྟེན་གྱི་ཁམས་གཞན་དང་གཞན་དག་གི་དེ་བཞིན་གཤེགས་པ་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་དག་གིས་ཀུན་ནས་བཀྱེ་བའི་
en: and Bhaiṣajyasamudgata. Moreover,

source: བྱང་ཆུབ་སེམས་དཔའ་བྱེ་བ་ཁྲག་ཁྲིག་ཕྲག་བདུན་ཅུ་རྩ་གཉིས
en: present with the Bhagavat were seventy-two quintillion bodhisattvas,

source: ་ཐམས་ཅད་ཀྱང་ཕྱིར་མི་ལྡོག་པའི་ཆོས་ཀྱི་འཁོར་ལོ་རབ་ཏུ་བསྐོར་བ་ཐམས་ཅད་ཀྱང་ཤིན་ཏུ་རྒྱས་པའི་སྡེ་དཀོན་མཆོག་བརྩེགས་པའི་མདོ་ཡོངས་སུ་ཞུ་བ་ལ་མཁས་པ།
en: They were skilled in inquiring about the Vaipulya Sūtras

source: ཐམས་ཅད་ཀྱང་ས་བཅུ་པ་ཆོས་ཀྱི་སྤྲིན་ཐོབ་པ།
en: and had obtained the level called Cloud of Dharma.

source: ཐམས་ཅད་ཀྱང་ཤེས་རབ་ཀྱིས་རི་རབ་ལྟར་གྱུར་པ།
en: In terms of wisdom, they were like Sumeru,

source: ཐམས་ཅད་ཀྱང་སྟོང་པ་ཉིད་དང་།
en: and all of them had thoroughly cultivated the dharmas of emptiness,

source: མཚན་མ་མེད་པ་དང་།
en: no sign,

source: སྨོན་པ་མེད་པ་དང་།
en: no wish,

source: སྐྱེ་བ་མེད་པ་དང་།
en: no birth,

source: འབྱུང་བ་མེད་པ་དང་།
en: no arising,

source: དངོས་པོ་མེད་པའི་སེམས་སུ་བསྒོམས་པའི་སེམས་དང་ལྡན་པ།
en: and no existence.

source: ཐམས་ཅད་ཀྱང་ཆོས་ཟབ་མོའི་སྣང་བ་ཆེན་པོ་ཐོབ་པ།
en: The greatly profound Dharma appeared to them ,

source: ཐམས་ཅད་ཀྱང་དེ་བཞིན་གཤེགས་པའི་སྤྱོད་ལམ་དང་ལྡན་པ།
en: and they had the postures of the tathāgatas.

source: ཐམས་ཅད་ཀྱང་མངོན་པར་ཤེས་པ་ཡོངས་སུ་སྦྱངས་པས་ངེས་པར་འབྱུང་བ་ཐམས་ཅད་ཀྱི་ངོ་བོ་ཉིད་ཀྱི་རང་བཞིན་ལ་གནས་པ་ཤ་སྟག་དང་ཐབས་ཅིག་ཏུ་བཞུགས་སོ།
en: All of them were fully clairvoyant and well settled in the essential nature of all dharmas. In other world spheres, they had been sent out by quintillions of tathāgatas.

source: དེའི་ཚེ་ན་
en: At that time,

source: བཅོམ་ལྡན་འདས་འདི་སྙམ་དུ་བདག་གིས་
en: the Bhagavat thought,

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ཀྱི་མྱུར་བ་དང་། སྟོབས་དང་ཤུགས་ཆེན་པོ་ཡང་དག་པར་བསྐྱེད་པར་བྱ་བའི་ཕྱིར།
en: “To generate great swiftness, strength, impetus, and stamina in the bodhisattva great beings,

source: ཆོས་ཀྱི་གཏམ་བརྗོད་པར་བྱ་ཞིང་།
en: I shall give a Dharma discourse.

source: འཇིག་རྟེན་གྱི་ཁམས་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་དག་ནས།
en: From as many world spheres as there are grains of sand in the river Ganges,

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་གཟི་བརྗིད་ཆེ་བ་གཟི་བརྗིད་ཆེ་བ་དག་བསྡུ་བར་ཡང་བྱ།
en: I shall cause splendorous bodhisattva great beings to assemble.

source: བདག་གིས་ཆོས་བསྟན་པ་ཆེན་པོའི་ཆོས་ཀྱི་རྣམ་གྲངས་བཤད་པའི་ལྟས་སྣང་བ་ཆེན་པོའང་བསྟན་པར་བྱ།
en: Hence, I will display a sign to show that there is to be a great teaching of the Dharma.

source: བདག་གིས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ལྷགས་ནས་བདག་ལ་ཆོས་བསྟན་པ་ཆེན་པོ་ཡོངས་སུ་ཞུ་བར་འགྱུར་བར་ཡང་བྱའོ་སྙམ་དུ་དགོངས་སོ།
en: I shall cause a great light, so that bodhisattva great beings shall come to me and ask for a great Dharma teaching.”

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་དེའི་ཚེ།
en: With that thought,

source: ཕྱོགས་བཅུའི་འཇིག་རྟེན་གྱི་ཁམས་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་གྲངས་མེད་ཅིང་བསམ་གྱིས་མི་ཁྱབ་པ་དག་གི་རྡུལ་ཕྲ་རབ་ཀྱི་རྡུལ་སྙེད་དག་འོད་ཟེར་ཆེན་པོའི་སྤྲིན་དག་གིས་སྣང་བར་མཛད་དོ།
en: the Bhagavat illuminated the ten directions with great clouds of light rays that shone in as many worlds as there are atoms of dust in the great trichiliocosm—an uncountable and inconceivable number.

source: ཕྱོགས་བཅུའི་ཕྱོགས་རེ་རེ་ནས་ཀྱང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སངས་རྒྱས་ཀྱི་ཞིང་བྱེ་བ་ཁྲག་ཁྲིག་ཕྲག་འབུམ་ཕྲག་བརྗོད་དུ་མེད་པ་བཅུའི་རྡུལ་ཕྲ་རབ་ཀྱི་རྡུལ་སྙེད་དག་ལྷགས་སོ།
en: as many bodhisattva great beings as there are atoms of dust in ten ineffable quintillion buddhafields approached him from all the ten directions;

source: དེ་དག་ལ་བྱང་ཆུབ་སེམས་དཔའ་རེ་རེ་ཡང་བྱང་ཆུབ་སེམས་དཔའི་རྣམ་པར་འཕྲུལ་པ་བསམ་གྱིས་མི་ཁྱབ་པ་དག་གིས་འོངས་ཏེ་ལྷགས་ནས་ཀྱང་།
en: each and every bodhisattva great being arrived with exceptional feats beyond imagination.

source: བཅོམ་ལྡན་འདས་ལ་ཚུལ་དང་འཐུན་པའི་མཆོད་པ་བསམ་གྱིས་མི་ཁྱབ་པ་དག་བྱས་ནས།
en: They first performed a fitting, inconceivable worship of the Bhagavat,

source: བཅོམ་ལྡན་འདས་ཀྱི་སྤྱན་སྔར་རང་རང་གི་སྨོན་ལམ་གྱི་སྟོབས་ལས་བྱུང་བའི་པད་མའི་སྟན་དག་ལ་འཁོད་དེ།
en: and then sat down in front of him on lotus seats that appeared through the force of their aspirations.

source: བཅོམ་ལྡན་འདས་ལ་མིག་མི་འཛུམས་པར་ལྟ་ཞིང་སྡོད་པར་གྱུར་ཏོ།
en: They stayed still, looking at the Bhagavat without blinking.

source: དེའི་ཚེ་ན་ཆོས་ཀྱི་དབྱིངས་ཀྱི་སྙིང་པོའི་ཁང་བཟངས་དེའི་དབུས་སུ་སེང་གེའི་ཁྲི་ནོར་བུ་རིན་པོ་ཆེ་ཆེན་པོའི་པད་མའི་སྙིང་པོ་ཅན་
en: A lion throne within a great, jeweled lotus then appeared at the center of the Womb of Dharmadhātu Palace.

source: རྒྱར་དཔག་ཚད་བྱེ་བ་ཕྲག་གྲངས་མེད་པ་ཡོད་པ།
en: It was an uncountable number of leagues in width,

source: རིམ་གྱིས་མཐོ་བ་ནོར་བུ་རིན་པོ་ཆེ་ཀུན་ཏུ་སྣང་བ་ལས་གྲུབ་པ།
en: and of unprecedented height. It was made of gems and jewels sparkling in every way,

source: ནོར་བུ་རིན་པོ་ཆེ་གློག་གི་སྒྲོན་མའི་ཁ་ཁྱེར་གྱིས་ཡོངས་སུ་བསྐོར་བ།
en: with lightning for lamps,

source: ནོར་བུ་རིན་པོ་ཆེ་འོད་བསམ་གྱིས་མི་ཁྱབ་པའི་ལན་ཀན་གྱིས་ཡོངས་སུ་བསྐོར་བ།
en: and a surrounding railing made of gems and jewels.

source: ནོར་བུ་རིན་པོ་ཆེ་དཔེ་མེད་པས་ཡོངས་སུ་བསྐོར་བ།
en: Its staffs were of gems and jewels of inconceivable brilliance,

source: ནོར་བུ་རིན་པོ་ཆེ་སྣང་བ་དཔེ་ལས་འདས་པའི་ཕྲེང་བས་མཛེས་པར་བྱས་པ།
en: and incomparable gems and jewels enclosed it.

source: ནོར་བུ་རིན་པོ་ཆེ་དབང་གི་རྒྱལ་པོའི་དྲ་བས་ཀུན་ནས་གཡོགས་པ།
en: Jewel garlands splendid beyond comparison beautified the throne,

source: ནོར་བུ་རིན་པོ་ཆེ་རྣམ་པ་སྣ་ཚོགས་སྤྲས་པ།
en: studded with many types of precious gems.

source: གདུགས་དང་རྒྱལ་མཚན་དང་། བ་དན་བསྒྲེང་བ་དང་ལྡན་པ་ཞིག་བྱུང་བར་གྱུར་ཏོ།
en: It was hung about with raised parasols, standards, and flags.

source: སེང་གེའི་ཁྲི་ནོར་བུ་རིན་པོ་ཆེ་ཆེན་པོའི་སྙིང་པོ་ཅན་དེའི་ཁོ་ར་ཁོར་ཡུག་ནས་འོད་ཟེར་གྲངས་མེད་པ་བྱེ་བ་ཁྲག་ཁྲིག་འབུམ་ཕྲག་བཅུ་བྱུང་སྟེ།
en: From above the lion throne within the great lotus of gems and jewels,

source: འོད་ཟེར་དེ་དག་གིས་ཕྱོགས་བཅུའི་འཇིག་རྟེན་གྱི་ཁམས་གཞན་དང་གཞན་དག་སྣང་བ་ཆེན་པོས་ཁྱབ་པར་གྱུར་ཏོ།
en: ten innumerable quintillions of light rays now issued forth in all directions and illumined the very many world spheres in the ten directions by their great brightness.

source: ཡང་དེའི་ཚེ་ན་ཕྱོགས་བཅུའི་ཕྱོགས་རེ་རེ་ནས་
en: And at that very time, from each and every one of the ten directions,

source: ལྷ་དང་།
en: gods,

source: ཀླུ་དང་།
en: nāgas,

source: གནོད་སྦྱིན་དང་།
en: yakṣas,

source: དྲི་ཟ་དང་།
en: gandharvas,

source: ལྷ་མ་ཡིན་དང་།
en: demigods,

source: ནམ་མཁའ་ལྡིང་དང་།
en: garuḍa,

source: མིའམ་ཅི་དང་།
en: kinnaras,

source: ལྟོ་འཕྱེ་ཆེན་པོ་དང་།
en: great serpents,

source: བརྒྱ་བྱིན་དང་།
en: śakras,

source: ཚངས་པ་དང་།
en: brahmās,

source: འཇིག་རྟེན་སྐྱོང་བ་སངས་རྒྱས་ཀྱི་ཞིང་བྱེ་བ་ཁྲག་ཁྲིག་འབུམ་ཕྲག་བརྗོད་དུ་མེད་པ་བཅུའི་རྡུལ་ཕྲ་རབ་ཀྱི་རྡུལ་སྙེད་དག་ཀྱང་ལྷགས་པར་གྱུར་ཏེ།
en: and world protectors arrived, as many as there are atoms of dust in the ineffable quintillion buddhafields.

source: དེ་དག་ལས་ཁ་ཅིག་ནི་རིན་པོ་ཆེའི་ཁང་པ་བརྩེགས་པ་དག་ན་འཁོད་ལ།
en: Some of them arrived together,they sat in jeweled palaces.

source: ལྷའི་བུ་མོ་བྱེ་བ་ཁྲག་ཁྲིག་འབུམ་ཕྲག་
en: with a quintillion apsaras,

source: གྲངས་མེད་ཅིང་
en: uncountable

source: བསམ་གྱིས་མི་ཁྱབ་པ་གླུ་དབྱངས་དང་།
en: and beyond conception, singing

source: རོལ་མོའི་སྒྲ་འབྱིན་པ་དག་དང་ལྷགས་སོ།
en: and playing musical instruments while

source: ཁ་ཅིག་ནི་མེ་ཏོག་ལས་བྱས་པ་དག་དང་།
en: Some arrived with palaces that were made of flowers,

source: ཁ་ཅིག་ནི་ཙན་དན་སྦྲུལ་གྱི་སྙིང་པོ་ལས་བྱས་པ་དག་དང་།
en: others with palaces were made of heaps of uragasāra sandalwood.

source: ཁ་ཅིག་ནི་མུ་ཏིག་ལས་བྱས་པ་དག་དང་།
en: Some palaces were made of pearls,

source: ཁ་ཅིག་ནི་རྡོ་རྗེ་ལས་བྱས་པ་དག་དང་།
en: others of diamonds,

source: ཁ་ཅིག་ནི་ནོར་བུ་རིན་པོ་ཆེ་རྡོ་རྗེ་ལྟར་སྣང་བ་ལས་བྱས་པ་དག་དང་།
en: and others still of gems and jewels that shone like diamonds.

source: ཁ་ཅིག་ནི་འཛམ་བུའི་ཆུ་བོའི་གསེར་ལས་བྱས་པ་དག་དང་།
en: Some were made of gold from the river Jāmbū,

source: ཁ་ཅིག་ནི་ནོར་བུ་རིན་པོ་ཆེ་འོད་ཐམས་ཅད་ཡང་དག་པར་འདུས་པ་ལས་བྱས་པ་དག་དང་།
en: and others were built with gems that shone in all colors.

source: ཁ་ཅིག་ནི་ནོར་བུ་རིན་པོ་ཆེ་དབང་གི་རྒྱལ་པོ་ལས་བྱས་པ་དག་དང་།
en: Some were made of the vaśirāja gem

source: ཁ་ཅིག་ནི་ནོར་བུ་རིན་པོ་ཆེ་ཡིད་བཞིན་གྱི་ནོར་བུ་ལས་བྱས་པ་དག་དང་།
en: and others of wish-fulfilling jewels.

source: ཁ་ཅིག་ནི་ནོར་བུ་རིན་པོ་ཆེ་བརྒྱ་བྱིན་ཐོགས་པ་ལས་བྱས་པ་དག་དང་།
en: Still other palaces were made of those gems worn by Śakra.

source: ཁ་ཅིག་ནི་རྒྱ་མཚོའི་རྟེན་རྣམ་པར་དག་པའི་རིན་པོ་ཆེའི་བཀོད་པ་སྟོང་ལྟ་བུ་ནོར་བུ་རིན་པོ་ཆེ་ཆེན་པོ་ཀུན་ནས་འོད་ཟེར་སྣང་བ་ལས་བྱས་པའི་ཁང་པ་བརྩེགས་པ་དག་ལ་འཁོད་ལ།ལྷའི་བུ་མོ་བྱེ་བ་ཁྲག་ཁྲིག་འབུམ་ཕྲག་གྲངས་མེད་ཅིང་བསམ་གྱིས་མི་ཁྱབ་པའི་གླུ་དབྱངས་དང་རོལ་མོའི་སྒྲ་འབྱིན་པ་དག་ལྷགས་སོ།
en: Yet others arrived with uncountable, inconceivable quadrillions of apsaras, singing and playing musical instruments while they sat in palaces of great jewels, gems beaming uninterruptedly from the array of pure, ocean-ground jewels.

source: ལྷགས་ནས་ཀྱང་
en: As they arrived,

source: བཅོམ་ལྡན་འདས་ལ་བསམ་གྱིས་མི་ཁྱབ་པ་དང་།
en: they first worshipped the Bhagavat in an inconceivable,

source: མཚུངས་པ་མེད་པ་དང་།
en: matchless,

source: གཞལ་དུ་མེད་པ་དང་།
en: immeasurable,

source: དཔག་ཏུ་མེད་པ་ལས་ཀྱང་ཤིན་ཏུ་འདས་པའི་མཆོད་པ་བྱས་ཏེ།
en: and limitless manner.

source: བཅོམ་ལྡན་འདས་ཀྱི་སྤྱན་སྔར་རང་རང་གི་སྨོན་ལམ་གྱི་སྟོབས་ལས་བྱུང་བའི་སྟན་དག་ལ་འཁོད་ནས།
en: Then they arranged themselves on one side, on seats that manifested through their own aspirations.

source: བཅོམ་ལྡན་འདས་ལ་མིག་མི་འཛུམས་པས་ལྟ་ཞིང་སྡོད་པར་གྱུར་ཏོ།
en: After having seated themselves, they stayed still, looking at the Bhagavat without blinking.

source: སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་འདི་འཛམ་བུ་ཆུ་བོའི་གསེར་ལས་གྲུབ་པར་ཀུན་ཏུ་གནས་པར་གྱུར་ཅིང་།
en: this world sphere, a great trichiliocosm, turned into Jāmbū River gold.

source: ནོར་བུ་རིན་པོ་ཆེ་ཆེན་པོ་སྣ་ཚོགས་ཀྱི་ཤིང་ལྗོན་པ་དག་གིས་ལེགས་པར་བརྒྱན་པ་དང་།
en: It was adorned with trees of many great gems and jewels,

source: ལྷའི་མེ་ཏོག་གི་ཤིང་ལྗོན་པ་དག་དང་།
en: divine flowering trees,

source: གོས་ཀྱི་ཤིང་ལྗོན་པ་དག་དང་།
en: trees of fine fabrics,

source: ཙན་དན་སྦྲུལ་གྱི་སྙིང་པོའི་ཤིང་ལྗོན་པ་དག་དང་།
en: sandalwood perfume.

source: སྤོས་ཀྱི་ཤིང་ལྗོན་པ་དག་དང་། ཨ་ག་རུའི་ཤིང་ལྗོན་པ་དག་གིས་ཀྱང་ལེགས་པར་བརྒྱན་ཅིང་།
en: and trees of uragasāra

source: ནོར་བུ་རིན་པོ་ཆེ་
en: and vidyutpradīpa gems.

source: ཉི་མ་དང་
en: sun gems,

source: ཟླ་བ་དང་།
en: a net of precious moon gems,

source: གློག་གི་སྒྲོན་མའི་དྲ་བས་ཀུན་ནས་ཁེབས་པ་དང་།
en: It was covered with

source: གདུགས་དང་རྒྱལ་མཚན་དང་།
en: Parasols, standards,

source: བ་དན་བསྒྲེང་བ་དང་ལྡན་ལ།
en: and flags were hoisted.

source: ཤིང་ལྗོན་པ་ཐམས་ཅད་ལ་ཡང་ལྷའི་བུ་མོ་བྱེ་བ་ཁྲག་ཁྲིག་འབུམ་ཕྲག་གྲངས་མེད་པ་མུ་ཏིག་གི་དོ་ཤལ་ལུས་ཕྱེད་ལ་ཐོགས་པ་དང་།
en: Innumerable quintillions of apsaras with half their bodies in sight thronged all trees,

source: རིན་པོ་ཆེའི་ཕྲེང་བ་ཐོགས་པ་དག་འཁོད་པར་གྱུར་ཏོ།
en: which were enveloped by strings of pearls and garlands of great precious jewels.

source: དེའི་ཚེ་ན་སེང་གེའི་ཁྲི་ནོར་བུ་རིན་པོ་ཆེ་ཆེན་པོའི་སྙིང་པོ་ཅན་དེ་ལས་ཚིགས་སུ་བཅད་པ་འདི་དག་བྱུང་ངོ་།
en: At that time these verses rang out from the lion throne with its great, jeweled lotus inside:

source: ཁྱོད་ཀྱི་བསོད་ནམས་སྟོབས་ཀྱིས་བདག་བྱུང་སྟེ།
en: I came about by the force of your merit.

source: མི་དབང་རྒྱལ་པོ་ཚུར་གཤེགས་བཞུགས་སུ་གསོལ།
en: “Come, be seated, king of the best among men!

source: རྒྱལ་བ་རྐང་གཉིས་དམ་པ་འདེགས་བགྱི་སྟེ།
en: Victor, best among the two-footed.

source: དེ་རིང་བདག་གིས་བརྣག་པ་འདི་རྫོགས་འགྱུར།
en: Fulfilling my wish, today I shall support you,

source: བདག་གི་ལུས་འདི་རིན་ཆེན་རྒྱུས་གྲུབ་སྟེ།
en: “My body is made of jewels.

source: འདྲེན་པ་ཁྱོད་ཕྱིར་བདག་གིས་དཀྱིལ་ན་ནི།
en: Oh Guide, for your sake,

source: རིན་ཆེན་པད་མ་ཡིད་འོང་གཅིག་མཆིས་ཏེ།
en: At my center is a beautiful jewel lotus;

source: སྐྱོབ་པ་བདག་གི་བརྣག་པ་དེ་རྫོགས་མཛོད།
en: Protector, please fulfill my wish today!

source: རིན་ཆེན་པད་མ་འདི་ལ་བཞུགས་ནས་ནི།
en: “Seated on this jewel lotus,

source: བདག་དང་འཇིག་རྟེན་འདི་ཀུན་མཛེས་པར་མཛོད།
en: You shall beautify this entire world and me.

source: གང་ཐོས་སེང་གེའི་ཁྲི་འདི་འདྲ་ཐོབ་པ།
en: Hearing such Dharma, one obtains a lion throne like this!

source: ཆོས་དེ་སྲོག་ཆགས་བྱེ་མང་བསྟན་དུ་གསོལ།
en: You shall teach the Dharma to many millions of living beings.

source: ཁྱོད་ཀྱི་སྐུ་ལ་འོད་ཟེར་སྟོང་བྱུང་སྟེ།
en: “Thousands of light rays shining from your limbs

source: འཇིག་རྟེན་ཁམས་མང་རབ་ཏུ་སྣང་བྱེད་པ།
en: Illuminate many world spheres.

source: དེ་ནི་བདག་གིས་དགའ་མཆོག་སྐྱེས་པའི་མཚན།
en: This is the sign of someone in whom joy is born.

source: འདྲེན་པ་བདག་གི་སླད་དུ་བཞུགས་སུ་གསོལ།
en: Guide, ascend to me!

source: སྔོན་ཡང་བདག་གིས་ཕྱོགས་འདིར་རང་བྱུང་བའི།
en: In the past, in this very place,

source: ཐུབ་པ་བྱེ་བ་ཕྲག་བརྒྱད་བཏེག་གྱུར་པས།
en: I have supported eighty million self-arisen sages.

source: མྱུར་དུ་བཞུགས་ཏེ་ཕན་བཏགས་མཛད་དུ་གསོལ།
en: “Quickly, take your seat and grant your favor!

source: བཅོམ་ལྡན་དེང་འདིར་ཕན་གདགས་མཛད་དུ་གསོལ།
en: May the Bhagavat also, today, bestow his favor!”

source: དེ་ནས་བཅོམ་ལྡན་འདས་གདན་སྔ་མ་ལས་བཞེངས་ཏེ།
en: At this the Bhagavat arose from his previous seat

source: སེང་གེའི་ཁྲི་ནོར་བུ་རིན་པོ་ཆེ་ཆེན་པོ་པད་མོའི་སྙིང་པོ་ཅན་དེ་ལ་སྐྱིལ་མོ་ཀྲུང་བཅས་ཏེ་བཞུགས་ནས།
en: and sat down on the lion throne with its great jewel lotus inside. He sat with his legs crossed

source: ཐམས་ཅད་དང་ལྡན་པའི་བྱང་ཆུབ་སེམས་དཔའི་ཚོགས་ལ་རྣམ་པར་གཟིགས་ཏེ།
en: and observed the entire gathering of bodhisattvas.

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེ་དག་ལ་ཡང་དག་ཕུལ་གྱི་ཆོས་བསྟན་པའི་ལྟས་མཛད་དོ།
en: Then, to those bodhisattva great beings, he signaled that he was about to deliver a distinguished Dharma teaching.

source: དེའི་ཚེ་ན་ཐམས་ཅད་དང་ལྡན་པའི་བྱང་ཆུབ་སེམས་དཔའི་ཚོགས་རྣམས་འདི་སྙམ་དུ་སེམས་ཏེ།
en: At that very time, the entire assembly of bodhisattvas had the thought,

source: འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པ་འདིས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ལ་བདག་ཅག་གིས་ཐོས་ནས།
en: “The youthful Mañjuśrī should now inquire of the Tathāgata, the Arhat, the Perfect and Complete Buddha,

source: ཡུན་རིང་དུ་ལོན་པ་སྐྱེ་བ་མེད་པ་དང་། འགག་པ་མེད་པའི་ཆོས་ཀྱི་རྣམ་གྲངས་དེ་ཡོངས་སུ་ཞུས་ན་ཅི་མ་རུང་སྙམ་མོ།
en: about non-arising and non-cessation. We have not heard that Dharma teaching for a long time.”

source: དེ་ནས་འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པས།
en: The youthful Mañjuśrī had understood the Bhagavat’s signal,

source: བཅོམ་ལྡན་འདས་ཀྱིས་ལྷས་མཛད་པ་ཡང་རིག །བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེ་དག་གི་སེམས་ཀྱི་ཡོངས་སུ་རྟོགས་པ་ཡང་སེམས་ཀྱིས་ཤེས་ནས།
en: and he also knew what the bodhisattva great beings were thinking.

source: སྟན་ལས་ལངས་ནས་བླ་གོས་ཕྲག་པ་གཅིག་ཏུ་གཟར་ནས།
en: So he arose and adjusted his upper robe so that one shoulder was uncovered.

source: པུས་མོ་གཡས་པའི་ལྷ་ང་པད་མའི་སྙིང་པོ་ལ་བཙུགས་ཏེ།
en: He then knelt in front of the Bhagavat with his right knee placed in the center of a lotus.

source: བཅོམ་ལྡན་འདས་ག་ལ་བ་དེ་ལོགས་སུ་ཐལ་མོ་སྦྱར་བ་བཏུད་ནས།
en: With joined palms

source: བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ།
en: he then addressed this question to the Bhagavat:“With joined palms”

source: བཅོམ་ལྡན་འདས་སྐྱེ་བ་མ་མཆིས་པ་དང་། འགག་པ་མ་མཆིས་པ་ཞེས་བགྱི་ན།
en: “Bhagavat, ‘non-arising’ and ‘non-cessation’ have been spoken of.

source: བཅོམ་ལྡན་འདས་སྐྱེ་བ་མཆིས་པ་དང་། འགག་པ་མ་མཆིས་པ་ཞེས་བགྱི་བ་དེ་ཆོས་གང་གི་ཚིག་བླ་དགས་ལགས།
en: Bhagavat, to what dharma do the terms ‘non-arising’ and ‘non-cessation’ refer?”

source: དེའི་ཚེ་ཚིགས་སུ་བཅད་པ་འདི་དག་གསོལ་ཏོ།
en: He also expressed his question in verse: Mañjuśrī

source: མི་སྐྱེ་འགགས་པ་མ་མཆིས་པ།
en: Of ‘non-cessation’ and ‘non-arising.’

source: རྣམ་འདྲེན་ཁྱོད་ཀྱིས་བཤད་དུ་གསོལ།
en: “Guide, you speak

source: དེ་ཡི་ངེས་ཚིག་མཚན་ཉིད་དེ།
en: Greatly wise one,

source: ཅི་འདྲ་ཤེས་རབ་ཆེན་པོ་པ།
en: How do you explain those terms?

source: མི་སྐྱེ་འགག་པ་མ་མཆིས་པ།
en: “ ‘Non-cessation’ and ‘non-arising,’

source: དེ་ནི་ཇི་ལྟར་བརྗོད་པར་བགྱི།
en: Why are they called so?

source: དཔེ་རྣམས་དང་ནི་གཏན་ཚིགས་ཀྱིས།
en: Through analogies and reasons!

source: ཐུབ་ཆེན་བཤད་པ་མཛད་དུ་གསོལ།
en: Great sage, please tell us

source: བྱང་ཆུབ་སེམས་དཔའ་མང་པོ་འདུས་པ་འདི་དག་ནི།
en: “These many bodhisattvas have come here,

source: འཇིག་རྟེན་རྣམ་པར་འདྲེན་པ་རྣམས་ཀྱིས་བཀྱེ་ལགས་ཏེ།
en: Lord, by many guides of the world.

source: ཡེ་ཤེས་འཚལ་ཞིང་ཁྱོད་ལ་ཕྱག་འཚལ་མཆིས་ལགས་ན།
en: They were sent to salute you, Wishing for awareness;

source: དམ་ཆོས་རྒྱ་ཆེན་དམ་པ་བཤད་པར་མཛད་དུ་གསོལ།
en: So please teach the lofty and excellent, good Dharma!”
